projects/russian-transit/src/cfe/Русский_Транзит/Enums/ВидыОперацийПоручительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоручительства</Name>
			<Comment>Различение источника документа: ДДП (автозагрузка из API Сигмы) или ТД (ручная загрузка файла Владимира)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДДПАвто</Name>
					<Comment>Договор-поручительство, загруженный автоматически через API Сигма-Софт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТДФайл</Name>
					<Comment>Транзитная декларация, полученная из реестра ЭТД Владимира (CSV-файл)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/CommonModules/РусскийТранзитОбновлениеИБ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет миграцию только если в базе есть документы с пустым ВидОперации.
// Безопасно вызывать при каждом открытии формы списка ОПП - нагрузка минимальна
// (один запрос с ПЕРВЫЕ 1).
//
// Возвращаемое значение:
//   Структура с полями:
//     * НужнаЛиМиграция - Булево
//     * Обработано - Число (0 если миграция не запускалась)
Функция ВыполнитьМиграциюЕслиНужно() Экспорт

	Результат = Новый Структура("НужнаЛиМиграция, Обработано", Ложь, 0);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле
	|ИЗ
	|	Документ.ОперацияПоПоручительству КАК Операция
	|ГДЕ
	|	Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоручительства.ПустаяСсылка)";

	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.НужнаЛиМиграция = Истина;
	ИтогМиграции = ЗаполнитьВидОперацииДляСуществующих();
	Результат.Обработано = ИтогМиграции.Обработано;
	Возврат Результат;

КонецФункции


// Проставляет ВидОперации = ДДПАвто всем документам ОперацияПоПоручительству
// с пустой ссылкой. Одноразовая миграция при установке расширения v1 (ТД-интеграция).
//
// Параметры:
//   ОграничениеКоличества - Число - ограничение на количество документов за один вызов (0 - без ограничений)
//
// Возвращаемое значение:
//   Структура:
//     * Обработано - Число - сколько документов обновлено
//     * Ошибки - Массив строк с описаниями ошибок
//
Функция ЗаполнитьВидОперацииДляСуществующих(ОграничениеКоличества = 0) Экспорт

	Результат = Новый Структура("Обработано, Ошибки", 0, Новый Массив);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОперацияПоПоручительству КАК Операция
	|ГДЕ
	|	Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоручительства.ПустаяСсылка)";

	Если ОграничениеКоличества > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(ОграничениеКоличества, "ЧГ=0"));
	КонецЕсли;

	ЗначениеПоУмолчанию = Перечисления.ВидыОперацийПоручительства.ДДПАвто;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			Если ОбъектДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОбъектДокумента.ВидОперации = ЗначениеПоУмолчанию;
			ОбъектДокумента.ОбменДанными.Загрузка = Истина;
			ОбъектДокумента.Записать();
			Результат.Обработано = Результат.Обработано + 1;
		Исключение
			Результат.Ошибки.Добавить(СтрШаблон("%1: %2", Выборка.Ссылка, ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;

	ЗаписьЖурналаРегистрации(
		"РусскийТранзит.Миграция.ВидОперации",
		УровеньЖурналаРегистрации.Информация,
		,
		,
		СтрШаблон("Установлен ВидОперации=ДДПАвто у %1 документов. Ошибок: %2", Результат.Обработано, Результат.Ошибки.Количество()));

	Возврат Результат;

КонецФункции

// Возвращает статистику распределения документов ОперацияПоПоручительству по ВидуОперации.
// Используется для проверки миграции до/после.
//
// Возвращаемое значение:
//   Структура:
//     * ДДПАвто - Число
//     * ТДФайл - Число
//     * Пусто - Число
//
Функция ПодсчитатьДокументыПоВидуОперации() Экспорт

	Результат = Новый Структура("ДДПАвто, ТДФайл, Пусто", 0, 0, 0);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Операция.ВидОперации КАК ВидОперации,
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Документ.ОперацияПоПоручительству КАК Операция
	|СГРУППИРОВАТЬ ПО
	|	Операция.ВидОперации";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидОперации = Перечисления.ВидыОперацийПоручительства.ДДПАвто Тогда
			Результат.ДДПАвто = Выборка.Количество;
		ИначеЕсли Выборка.ВидОперации = Перечисления.ВидыОперацийПоручительства.ТДФайл Тогда
			Результат.ТДФайл = Выборка.Количество;
		Иначе
			Результат.Пусто = Выборка.Количество;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
